Autodesk.Revit.DB.ViewCropRegionShapeManager.GetSplitRegionOffset(System.Int32)
Returns the offset for the specified split crop region.
Remarks:
The points in the split crop region's boundary are not in model space.
Add the offset returned by this method to each point in the crop region's
boundary to transform the points into model space coordinates.
regionIndex:
Index of the split crop region (numbering starts with 0).
Returns:
A vector in model space representing the offset which is applied to the split crop region's boundary.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The provided region index is invalid.
Since:
2019.2

Autodesk.Revit.DB.ViewCropRegionShapeManager.GetAnnotationCropShape
Gets the annotation crop box assigned to the view.
Remarks:
Currently, this method returns only the rectangular annotation crop box.
Returns:
The annotation crop boundary.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View is not allowed to have an annotation crop.
Since:
2016

Autodesk.Revit.DB.ViewCropRegionShapeManager.GetCropShape
Gets the crop boundaries that are curently active.
Remarks:
This method returns a representation of the boundaries of the currently active crop for the associated view.
If the view crop has a non-rectangular shape, the method returns that shape.
Otherwise, if the view crop has been split, the method returns the multiple rectangular boundaries visible in the crop -
note that this does not reflect any offsets that may have been applied to the boundary regions.
If the crop is not split, this returns a single rectangle representing the crop.
All coordinates are in the coordinate frame of the view.
Returns:
The crop boundaries.
Since:
2016

Autodesk.Revit.DB.ViewCropRegionShapeManager.GetSplitRegionMaximum(System.Int32)
Returns the proportional location of the maximum boundary of the specified split crop region.
regionIndex:
Index of split crop region (numbering starts with 0).
Returns:
A value from 0 to 1 representing the maximum location for the region's split boundary.
This number represents the location as a ratio along the non-split rectangular crop.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The provided region index is invalid.
Since:
2016

Autodesk.Revit.DB.ViewCropRegionShapeManager.GetSplitRegionMinimum(System.Int32)
Returns the proportional location of the minimum boundary of the specified split crop region.
regionIndex:
Index of split crop region (numbering starts with 0).
Returns:
A value from 0 to 1 representing the minimum location for the region's split boundary.
This number represents the location as a ratio along the non-split rectangular crop.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The provided region index is invalid.
Since:
2016

Autodesk.Revit.DB.ViewCropRegionShapeManager.SplitRegionHorizontally(System.Int32,System.Double,System.Double)
Splits horizontally one region in split crop.
Remarks:
This function splits the crop into two regions: one occupying the left quarter of the crop, and the other the right quarter of the crop.
regionIndex:
Index of region to be split horizontally (numbering starts with 0).
leftPart:
Relative portion of the original region to become the new left region (0 to 1).
rightPart:
Relative portion of the original region to become the new right region (0 to 1).
Throws Autodesk.Revit.Exceptions.ArgumentException:
The provided view region proportions are not valid.
-or-
The provided region index is invalid.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The crop of the associated view is not permitted to have multiple regions.
-or-
The view has non-rectangular crop shape set.
-or-
The view crop is already split vertically.
Since:
2016

Autodesk.Revit.DB.ViewCropRegionShapeManager.SplitRegionVertically(System.Int32,System.Double,System.Double)
Splits vertically one region in split crop.
Remarks:
This function splits the crop into two regions: one occupying the top quarter of the crop, and the other the bottom quarter of the crop.
regionIndex:
Index of region to be split vertically (numbering starts with 0).
topPart:
Relative portion of the original region to become the new top region (0 to 1).
bottomPart:
Relative portion of the original region to become the new bottom region (0 to 1).
Throws Autodesk.Revit.Exceptions.ArgumentException:
The provided view region proportions are not valid.
-or-
The provided region index is invalid.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The crop of the associated view is not permitted to have multiple regions.
-or-
The view has non-rectangular crop shape set.
-or-
The view crop is already split horizontally.
Since:
2016

Autodesk.Revit.DB.ViewCropRegionShapeManager.RemoveSplitRegion(System.Int32)
Removes one region in split crop.
regionIndex:
Index of region to be deleted (numbering starts with 0).
Throws Autodesk.Revit.Exceptions.ArgumentException:
The provided region index cannot be deleted.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The crop of the associated view is not permitted to have multiple regions.
-or-
The view has non-rectangular crop shape set.
Since:
2016

Autodesk.Revit.DB.ViewCropRegionShapeManager.RemoveSplit
Removes any split applied to the view's crop.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The crop of the associated view is not permitted to have multiple regions.
Since:
2014

Autodesk.Revit.DB.ViewCropRegionShapeManager.RemoveCropRegionShape
Removes any non-rectangular boundary of the view's crop.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The crop of the associated view is not permitted to have a non-rectangular shape.
Since:
2014

Autodesk.Revit.DB.ViewCropRegionShapeManager.SetCropShape(Autodesk.Revit.DB.CurveLoop)
Sets the boundary of the view's crop to the specified shape.
Remarks:
Depending on the shape of the argument, view's crop is set to be either rectangular or non-rectangular.
If the crop is set to be rectangular and it is also split, then the multiple view regions will be displayed for the view,
with the same proportions as the split prior to the change, but adjusted to the new rectangular shape.
boundary:
The crop boundary.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Boundary in boundary should represent one closed curve loop without self-intersections,
consisting of non-zero length straight lines in a plane parallel to the view plane.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The crop of the associated view is not permitted to have a non-rectangular shape.
Since:
2014

Autodesk.Revit.DB.ViewCropRegionShapeManager.IsCropRegionShapeValid(Autodesk.Revit.DB.CurveLoop)
Verifies that boundary represents one closed curve loop without self-intersections,
consisting of non-zero length straight lines in a plane parallel to the view plane.
Remarks:
Curves in boundary use model coordinates.
boundary:
The crop boundary.
Returns:
True if the passed crop boundary represents one closed curve loop without self-intersections,
consisting of non-zero length straight lines in a plane parallel to the view plane.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ViewCropRegionShapeManager.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ViewCropRegionShapeManager.RightAnnotationCropOffset
The offset from the right of the view crop that determines the location of the annotation crop right boundary.
Remarks:
This value must be a non-negative length in view units.
Default value is 1/12' (1"), minimal value is 1/96' (1/8").
To get offset in model units, multiply the value by the view scale.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for offset must be non-negative.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View is not allowed to have an annotation crop.
Since:
2016

Autodesk.Revit.DB.ViewCropRegionShapeManager.LeftAnnotationCropOffset
The offset from the left of the view crop that determines the location of the annotation crop left boundary.
Remarks:
This value must be a non-negative length in view units.
Default value is 1/12' (1"), minimal value is 1/96' (1/8").
To get offset in model units, multiply the value by the view scale.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for offset must be non-negative.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View is not allowed to have an annotation crop.
Since:
2016

Autodesk.Revit.DB.ViewCropRegionShapeManager.BottomAnnotationCropOffset
The offset from the bottom of the view crop that determines the location of the annotation crop bottom boundary.
Remarks:
This value must be a non-negative length in view units.
Default value is 1/12' (1"), minimal value is 1/96' (1/8").
To get offset in model units, multiply the value by the view scale.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for offset must be non-negative.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View is not allowed to have an annotation crop.
Since:
2016

Autodesk.Revit.DB.ViewCropRegionShapeManager.TopAnnotationCropOffset
The offset from the top of the view crop that determines the location of the annotation crop top boundary.
Remarks:
This value must be a non-negative length in view units.
Default value is 1/12' (1"), minimal value is 1/96' (1/8").
To get offset in model units, multiply the value by the view scale.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for offset must be non-negative.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View is not allowed to have an annotation crop.
Since:
2016

Autodesk.Revit.DB.ViewCropRegionShapeManager.CanHaveAnnotationCrop
Verifies that the view is allowed to have an annotation crop.
Since:
2016

Autodesk.Revit.DB.ViewCropRegionShapeManager.IsSplitVertically
Whether or not the view's crop is split (and the split is vertical).
Since:
2016

Autodesk.Revit.DB.ViewCropRegionShapeManager.IsSplitHorizontally
Whether or not the view's crop is split (and the split is horizontal).
Since:
2016

Autodesk.Revit.DB.ViewCropRegionShapeManager.NumberOfSplitRegions
The number of split crop regions (1 if the crop is not currently split).
Since:
2016

Autodesk.Revit.DB.ViewCropRegionShapeManager.ShapeSet
Whether or not the view crop has a non-rectangular shape set.
Remarks:
This property reflects the actual shape of the crop region.
Thus, if this property is true the view Split property is false.
Since:
2014

Autodesk.Revit.DB.ViewCropRegionShapeManager.Split
Whether or not the view crop is split.
Remarks:
This property reflects the actual visual split of the crop region.
Thus, if the view has non-rectangular crop shape set, this property is false.
Since:
2014

Autodesk.Revit.DB.ViewCropRegionShapeManager.CanBeSplit
Verifies that the crop of the associated view is permitted to have multiple regions.
Since:
2016

Autodesk.Revit.DB.ViewCropRegionShapeManager.CanHaveShape
Verifies that the crop of the associated view is permitted to have a non-rectangular shape.
Since:
2016

Autodesk.Revit.DB.ViewCropRegionShapeManager
A class that provides access to settings related to the crop assigned to a view or a reference callout.
Remarks:
This class manages all the settings that make up the model and annotation crop geometry for a given view or reference callout.
You can obtain the settings for a view from Autodesk.Revit.DB.View.GetCropRegionShapeManager.
Obtain the settings for a reference callout from Autodesk.Revit.DB.View.GetCropRegionShapeManagerForReferenceCallout(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId).
The model crop region crops model elements, detail elements (such as insulation and detail lines), section boxes,
and scope boxes at the model crop boundary.
Visible crop boundaries of other related views are also cropped at the model crop boundary.
The model crop region can be set as a polygonal boundary, a rectangular boundary,
or rectangular boundary with one or more splits applied either horizontally or vertically.
If a split is applied to the rectangular crop each resulting rectangular region is identified by a region index and occupies
a percentage of the original crop rectangle. The regions may possibly be moved relative to one another.
The annotation crop region fully crops annotation elements when it touches any portion of the annotation element,
so that no partial annotations are drawn.
Annotations (such as symbols, tags, keynotes, and dimensions) that reference hidden or cropped model elements do not display in the view,
even if they are inside the annotation crop region.
The annotation crop region is always rectangular and at minimum occupies the same area as the rectangular model crop
(or the corresponding rectangular boundary around the non-rectangular model crop),
but can be offset to be bigger than the model crop in order to display more annotations.
Since:
2014